app/controllers/cards_controller.rb

  def create
    card = Card.new(card_params)
    if card.save
---
INSERT INTO "cards" ("content", "color", "pick", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "something"], ["color", "black"], ["pick", 2], ["room_id", 1], ["created_at", 2017-02-20 13:25:12 UTC], ["updated_at", 2017-02-20 13:25:12 UTC]]

  def index
    cards = Card.all
---
SELECT "cards".* FROM "cards"

  def destroy
    @card = Card.find(params[:id])
    @card.destroy
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 1]]