app/controllers/rooms_controller.rb

  def show
    @room = Room.find(params[:id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    room = Room.new(room_params)
    if room.save
---
INSERT INTO "rooms" ("title", "black_card", "pick", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "something"], ["black_card", "There's a new dance on Gallifrey. It's called the _."], ["pick", "1"], ["created_at", 2017-02-21 12:03:23 UTC], ["updated_at", 2017-02-21 12:03:23 UTC]]

  def destroy
    @room = Room.find(params[:id])
    @room.destroy
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "rooms" WHERE "rooms"."id" = $1  [["id", 5]]